name: "interval"
state {
  phase: TRAIN
  level: 0
}
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 5
      dim: 2
    }
  }
}

layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "data"
  top: "out"
 inner_product_param {
    num_output: 5
    weight_filler {
      type: "constant"
    }
    bias_term: false
  }
}
